using System.Collections.Generic;

namespace H1_ThirdPartyWalletAPI.Model.Game.PG.Model
{
    /// <summary>
    /// PG ErrorCode訊息對照
    /// </summary>
    public static class ErrorCode
    {
        public static Dictionary<int, string> ErrorCodeDictionary = new Dictionary<int, string>
        {
            { 1034, "无效请求" },
            { 1035, "行动失败" },
            { 1200, "内部服务器失败" },
            { 1204, "无效运营商" },
            { 1300, "无效玩家令牌" },
            { 1301, "玩家令牌空置" },
            { 1302, "无效玩家令牌" },
            { 1303, "发生服务器错误" },
            { 1305, "无效玩家" },
            { 1306, "玩家被阻止访问当前游戏" },
            { 1307, "无效玩家令牌" },
            { 1308, "玩家令牌已过期" },
            { 1309, "玩家已被封锁" },
            { 1310, "运营商和玩家令牌验证失败" },
            { 1400, "游戏正在维护中" },
            { 1401, "游戏无效" },
            { 1402, "游戏不存在" },
            { 3001, "不能空值" },
            { 3004, "玩家不存在" },
            { 3005, "玩家钱包不存在" },
            { 3006, "玩家钱包已存在" },
            { 3009, "免费游戏不存在" },
            { 3013, "余额不足无法转出" },
            { 3014, "免费游戏无法取消" },
            { 3019, "免费游戏不足" },
            { 3021, "投注不存在" },
            { 3022, "投注已支付" },
            { 3030, "免费游戏过期" },
            { 3031, "免费游戏已经转换" },
            { 3032, "投注已存在" },
            { 3033, "投注失败" },
            { 3034, "支付失败" },
            { 3035, "倍数错误" },
            { 3036, "余额不足无法转换" },
            { 3040, "交易不存在" },
            { 3202, "余额不足无法投注" },
        };
    }
}