using System.Collections.Generic;

namespace H1_ThirdPartyWalletAPI.Model.Game.GR
{
    public class GR
    {
        // todo: 此列表現況無用 GR 沒提供可選語系列表
        // GR 回應: 可透過代理後台 預設代理底下玩家語系
        public static Dictionary<string, string> lang = new Dictionary<string, string>()
        {
            {"en-US", "en_US"},  // 英文
            {"zh-TW", "zh_TW"},  // 繁中
            {"zh-CN", "zh_CN"},  // 簡中 (此為預設)
        };

        // todo: 此列表現況無用 GR 沒提供可選幣別列表
        public static Dictionary<string, string> Currency = new Dictionary<string, string>()
        {
            {"THB", "THB"},  // 泰銖
        };

        // todo: 此列表現況無用 廠商錯誤代碼的常數列表
        public static Dictionary<string, string> RespCode = new Dictionary<string, string>()
        {
            // 共用的錯誤代碼
            {"111090003", "FAIL"},  // 沒有代理商資料，API 網域錯誤。
            {"111090004", "FAIL"},  // 傳入參數錯誤，請詳閱 API 所需之參數。
            {"111090012", "FAIL"},  // 代理 SecretKey 傳入參數錯誤，請檢查 secret_key
            {"111090013", "FAIL"},  // 取得遊戲網域失敗
            {"111090014", "FAIL"},  // 維護中，每個禮拜一北京時間 12：00 ~ 15：00 維護
            {"111090015", "FAIL"},  // 取得圖檔網域失敗
            {"111090016", "FAIL"},  // 此代理已經被移除
            {"111090005", "FAIL"},  // 使用者 Account 不存在
            // 充值提取
            {"112110001", "FAIL"},  // 改變使用者餘額失敗,請檢查注單
            {"112110002", "FAIL"},  // 輸入金額不能為負或零
            {"112240001", "FAIL"},  // 使用者在遊戲中不能轉出金額錯誤
            {"112260001", "FAIL"},  // 自定義的 OrderID 長度不能超過 50
            {"112280001", "FAIL"},  // 代理額度不足
            {"112280002", "FAIL"},  // 代理目前被鎖定無法轉入轉出
            // 建立帳號
            {"112100001", "FAIL"},  // 建立使用者失敗
            {"112100002", "FAIL"},  // 建立使用者失敗,代理帳號不存在
            {"112100003", "FAIL"},  // 建立使用者的帳號僅能是數字或英文
            {"112100004", "FAIL"},  // 後綴碼僅能是數字或英文, 及長度要為 2~5 個
            {"112100005", "FAIL"},  // Regexp 判斷字串發生錯誤
            {"112100006", "FAIL"},  // 建立使用者的顯示名稱長度要為 3~25
            {"112100007", "FAIL"},  // 帳號字元超過 25 個字
            {"112100008", "FAIL"},  // 此帳號已存在, 無法再次創建
            // 拉帳
            {"112090001", "FAIL"},  // 時間格式錯誤
            {"112090002", "FAIL"},  // 起始時間不能在結束時間之後
            {"112090003", "FAIL"},  // 起始時間不能在現在時間之後
            {"112090004", "FAIL"},  // 結束時間不能在現在時間之後
            {"112090005", "FAIL"},  // 時間僅能在從現在起 31 天內
            {"112090006", "FAIL"},  // 時間格式不同請統一
            {"112120001", "FAIL"},  // 取得使用者下注歷史資訊失敗
            // 其他
            {"112170001", "FAIL"},  // 藉由帳號取得 SID 失敗
            {"112180001", "FAIL"},  // 取得餘額失敗
            {"112220001", "FAIL"},  // 確認使用者是否存在失敗
            {"112250001", "FAIL"},  // 取得活動紀錄錯誤,錯誤的活動 Key
            {"112250002", "FAIL"},  // 取得活動紀錄失敗
            {"112290001", "FAIL"},  // 取得代理額度失敗
            {"112270001", "FAIL"},  // 取得代理遊戲列表失敗
            {"112270002", "FAIL"},  // 無法找到相對應的遊戲類別失敗
            {"112270003", "FAIL"},  // 錯誤的語系類別
        };
    }
}
